---
kind: other
id: Properties.T:Autodesk.Revit.DB.GeometryObject
source: html/832edc22-a6cd-3c68-eda3-aeb5ec45a1e4.htm
---
# GeometryObject Properties

The ElementId of the GeometryObject's GraphicsStyle